package by.it.toporova.jd01_05;

import java.util.Scanner;
//Ввести n чисел с консоли.
//1.Найти самое короткое и самое длинное число. Вывести найденные числа и их длину.
//2.Упорядочить и вывести числа в порядке возрастания значений их длины.
//3.Вывести на консоль те числа, длина которых меньше средней, а также длину.
//4.Найти число, в котором число различных цифр минимально. Если таких чисел несколько, найти первое из них.
//5.Найти количество чисел, содержащих только четные цифры, а среди них —количество чисел с равным числом четных и нечетных цифр.
//6.Найти число, цифры в котором идут в строгом порядке возрастания. Если таких чисел несколько, найти последнее из них.
//7.Найти число, состоящее только из различных цифр. Если таких чисел несколько, найти первое из них.
//8.Среди чисел найти число-палиндром. Если таких чисел больше одного, найти второе.

//Ввести с консоли n-размерность матрицы a [n] [n].
//Задать значения элементов матрицы в интервале значений от -n до n с помощью датчика случайных чисел.
//1.Выполнить циклический сдвиг заданной матрицы на n-2позиций вправо.
//2.Повернуть матрицу на 90 градусов против часовой стрелки.
//3.Построить матрицу, вычитая из элементов каждой строки матрицы ее среднее арифметическое.
//4.Уплотнить матрицу, удаляя из нее строки и столбцы, заполненные нулями.
//5.В матрице найти минимальный элемент и переместить его на место [1][2]путем перестановки строк и столбцов.
//6.Преобразовать строки матрицы таким образом, чтобы элементы, равные 1, располагались после всех остальных.
//7.Округлить все элементы матрицы до целого числа.
//8.Перестроить матрицу, переставляя в ней строки так, чтобы сумма элементов в строках полученной матрицы возрастала.

public class TaskExtra {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);

    }

}
